let azkar = () => {
  let hours = new Date().getHours();
  let switchBtn = document.querySelector(".header .switch-btn");
  let sliderBtn = document.querySelector(".header .switch-btn .slider-btn");

  let morningMode = () => {
    let starsOrClouds = document.getElementById("starsOrClouds");
    let body = document.body;
    let span = document.querySelector(".header h1 span");
    starsOrClouds.innerHTML = "";
    switchBtn.style.backgroundColor = "#79D4FF";
    sliderBtn.style.right = "2.5%";
    body.style.backgroundColor = "#79D4FF";
    span.innerHTML = "الصباح";
    let stars = () => {
      let sunContainer = document.createElement("div");
      sunContainer.className = "sun-container";
      let sun = document.createElement("div");
      sun.className = "sun";
      sunContainer.appendChild(sun);
      starsOrClouds.appendChild(sunContainer);
      for (let i = 0; i < 50; i++) {
        let div = document.createElement("div");
        div.className = "clouds";
        div.style.top = `${Math.round(Math.random() * 100)}%`;
        div.style.left = `${Math.round(Math.random() * 100)}%`;
        starsOrClouds.appendChild(div);
      }
    };
    starsOrClouds.style.transition = "1s all";
    stars();
  };

  let nightMode = () => {
    let starsOrClouds = document.getElementById("starsOrClouds");
    let body = document.body;
    let span = document.querySelector(".header h1 span");
    starsOrClouds.innerHTML = "";
    switchBtn.style.backgroundColor = "#3C426B";
    sliderBtn.style.right = "52.5%";
    body.style.backgroundColor = "#3C426B";
    span.innerHTML = "المساء";
    let clouds = () => {
      let moonContainer = document.createElement("div");
      moonContainer.className = "moon-container";
      let moon = document.createElement("div");
      moon.className = "moon";
      moonContainer.appendChild(moon);
      starsOrClouds.appendChild(moonContainer);
      for (let i = 0; i < 50; i++) {
        let div = document.createElement("div");
        div.className = "stars";
        div.style.top = `${Math.round(Math.random() * 100)}%`;
        div.style.left = `${Math.round(Math.random() * 100)}%`;
        starsOrClouds.appendChild(div);
      }
    };
    clouds();
  };

  let azkarText = [
    {
      text: [
        "آية الكرسي<br>﴿ اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ﴾<br>[آية الكرسى - البقرة 255]",
      ],
      times: 1,
      fadl: "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. ",
    },
    {
      text: [
        "",
        "﴿ آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ﴾<br> [البقرة 285 - 286]",
      ],
      times: 1,
      fadl: "من قرأ آخر آيتين من سورة البقرة في ليلة كفتاه",
    },
    {
      text: [
        "سورة الاخلاص<br>﴿ قُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ ﴾",
      ],
      times: 3,
      fadl: "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
    },
    {
      text: [
        "سورة الفلق<br>﴿ قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ ﴾",
      ],
      times: 3,
      fadl: "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
    },
    {
      text: [
        "سورة الناس<br>﴿ قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَهِ النَّاسِ، مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَ النَّاسِ ﴾",
      ],
      times: 3,
      fadl: " من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).",
    },
    {
      text: [
        "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
        "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر",
      ],
      times: 1,
      fadl: "كانَ نَبِيُّ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ، إذَا أَمْسَى قالَ: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ لا إلَهَ إلَّا اللَّهُ، وَحْدَهُ لا شَرِيكَ له قالَ: أُرَاهُ قالَ فِيهِنَّ: له المُلْكُ وَلَهُ الحَمْدُ وَهو علَى كُلِّ شيءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ ما في هذِه اللَّيْلَةِ وَخَيْرَ ما بَعْدَهَا، وَأَعُوذُ بكَ مِن شَرِّ ما في هذِه اللَّيْلَةِ وَشَرِّ ما بَعْدَهَا، رَبِّ أَعُوذُ بكَ مِنَ الكَسَلِ وَسُوءِ الكِبَرِ، رَبِّ أَعُوذُ بكَ مِن عَذَابٍ في النَّارِ وَعَذَابٍ في القَبْرِ وإذَا أَصْبَحَ قالَ ذلكَ أَيْضًا: أَصْبَحْنَا وَأَصْبَحَ المُلْكُ لِلَّهِ.",
    },
    {
      text: [
        "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه",
        "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا",
      ],
      times: 1,
      fadl: "قال رسول الله صلى الله عليه وسلم: إذا أصبح أحدكم فليقل أصبحنا وأصبح الملك لله رب العالمين اللهم إني أسألك خير هذا اليوم فتحه ونصره ونوره وبركته وهداه وأعوذ بك من شر ما فيه وشر ما بعده ثم إذا أمسى فليقل مثل ذلك",
    },
    {
      text: [
        "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور",
        "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ",
      ],
      times: 1,
      fadl: "عن أبي هريرة رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم إذا أصبح يقول: ( اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت وإليك النشور ) وإذا أمسى قال مثل ذلك إلا أنه قال: ( وإليك المصير ) أخرجه الأربعة.",
    },
    {
      text: [
        "اللّهُـمَّ ما أَصبح بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
        "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر",
      ],
      times: 1,
      fadl: "من قالها حين يصبح أدى شكر يومه. ومن قالها حين يمسى أدى شكر ليلته.",
    },
    {
      text: [
        "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك",
        "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك",
      ],
      times: 4,
      fadl: "من قالها أعتقه الله من النار.",
    },
    {
      text: [
        "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ",
        "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ",
      ],
      times: 1,
      fadl: "حدثنا محمد بن جعفر حدثنا شعبة عن سلمة بن كهيل عن ذر عن ابن عبد الرحمن بن أبزى عن أبيه عن النبي صلى الله عليه وسلم أنه قال أصبحنا على فطرة الإسلام وعلى كلمة الإخلاص وعلى دين نبينا محمد صلى الله عليه وسلم وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين",
    },
    {
      text: [
        "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ",
      ],
      times: 1,
      fadl: "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
    },
    {
      text: [
        "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ",
      ],
      times: 1,
      fadl: "ذكر طيب - الحديث ضعيف، ولكن إذا عمل به الإنسان رجاء أن ينفعه الله به فهو ذكر طيب، وهو ذكر عظيم ذكر طيب لا بأس به، لكن من غير اعتقاد أنه يحصل به هذا المطلوب، وبغير اعتقاد أنه سنة، لكنه ذكر من أعظم الذكر المشروع.",
    },
    {
      text: [
        "اللّهُـمَّ فاطِـرَ السّماواتِ وَالأرْضِ عالِـمَ الغَـيْبِ وَالشّـهادَةِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم",
      ],
      times: 1,
      fadl: 'عن أبي هريرة أَنَّ أَبا بَكرٍ الصِّدِّيقَ، ، قَالَ: يَا رَسُولَ اللَّهِ مُرْنِي بِكَلمَاتٍ أَقُولُهُنَّ إِذَا أَصْبَحْتُ وإِذَا أَمْسَيتُ، قَالَ: قُلْ: اللَّهُمَّ فَاطِرَ السَّمَواتِ والأرضِ عَالمَ الغَيْب وَالشَّهَادةِ، ربَّ كُلِّ شَيءٍ وَمَلِيكَهُ. أَشْهَدُ أَن لاَ إِله إِلاَّ أَنتَ، أَعُوذُ بكَ منْ شَرِّ نَفسي وشَرِّ الشَّيْطَانِ وَشِرْكهِ" قَالَ: "قُلْها إِذا أَصْبحْتَ، وَإِذا أَمْسَيْتَ، وإِذا أَخذْتَ مَضْجِعَكَ رواه أَبُو داود والترمذي وقال: حديثٌ حسنٌ صحيحٌ.',
    },
    {
      text: [
        "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي",
      ],
      times: 1,
      fadl: "لم يكنْ رسولُ اللهِ صلى الله عليه وسلم يَدَعُ هؤلاء الدعواتِ حينَ يُمسي، وحينَ يُصبِحُ",
    },
    {
      text: [
        "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ ، اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ",
      ],
      times: 3,
      fadl: "قال عبدالرحمن بن أبي بكرة يا أَبتِ، إنِّي أَسمَعُك تَدْعو كلَّ غَداةٍ: اللَّهمَّ عافِني في بَدَني، اللَّهمَّ عافِني في سَمْعي، اللَّهمَّ عافِني في بَصَري، لا إلهَ إلَّا أنتَ؛ تُعيدُها ثلاثًا حينَ تُصبِحُ، وثَلاثًا حينَ تُمسي؟ فَقال: إنِّي سَمِعتُ رَسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم يَدْعو بِهنَّ، فأَنا أُحِبُّ أن أَستَنَّ بِسُنَّتِه. قال عبَّاسٌ فيهِ: وتَقولُ: اللَّهمَّ إنِّي أَعوذُ بكَ منَ الكُفرِ والفَقرِ، اللَّهمَّ إنِّي أَعوذُ بِكَ مِن عَذابِ القَبرِ، لا إلهَ إلَّا أنتَ، تُعيدُها ثَلاثًا حينَ تُصبِح، وثَلاثًا حينَ تُمسي، فتَدْعو بهِنَّ، فأُحِبُّ أن أَستَنَّ بِسُنَّتِه.",
    },
    {
      text: ["أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق"],
      times: 3,
      fadl: "ثبت عن رسول الله ﷺ أنه قال: من نزل منزلا فقال أعوذ بكلمات الله التامات من شر ما خلق، لم يضره شيء حتى يرتحل من منزله ذلك رواه الإمام مسلم في صحيحه",
    },
    {
      text: [
        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم",
      ],
      times: 3,
      fadl: "لم يضره من الله شيء.",
    },
    {
      text: [
        "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلُنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ",
      ],
      times: 3,
      fadl: "عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم لفاطمة رضي الله عنها : ما يمنعك أن تسمعي ما أوصيك به أن تقولي إذا أصبحت وإذا أمسيت: يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين . رواه النسائي والبزار بإسناد صحيح والحاكم وقال: صحيح على شرطهما . وحسنه الألباني في صحيح الترغيب والترهيب .",
    },
    {
      text: [
        "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم",
      ],
      times: 7,
      fadl: "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
    },
    {
      text: [
        "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً",
      ],
      times: 3,
      fadl: "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
    },
    {
      text: [
        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه",
      ],
      times: 3,
      fadl: "روى الإمام مسلم وغيره من حديث جويرية رضي الله عنها أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها، ثم رجع بعد أن أضحى وهي جالسة، فقال: ما زلت على الحال التي فارقتك عليها! قالت: نعم، قال النبي صلى الله عليه وسلم: لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن، سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته.",
    },
    {
      text: [
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ",
      ],
      times: 3,
      fadl: "روى أبو داود عن أبي سعيد الخدري قال: [دخل رسول الله صلى الله عليه وسلم، ذات يوم المسجد فإذا هو برجل من الأنصار يقال له: أبو أمامة، فقال يا أبا أمامة: ما لي أراك جالساً في المسجد في غير وقت الصلاة؟ قال: هموم لزمتني وديون يا رسول الله، قال: أفلا أعلمك كلاماً إذا أنت قلته أذهب الله عز وجل همك وقضى عنك دينك؟ قال: قلت بلى يا رسول الله، قال: قل إذا أصبحت وإذا أمسيت: اللهم إني أعوذ بك من الهم والحزن وأعوذ بك من العجز والكسل وأعوذ بك من الجبن والبخل وأعوذ بك من غلبة الدين وقهر الرجال، قال: ففعلت ذلك فأذهب الله عز وجل همي وقضى عني ديني].",
    },
    {
      text: [
        "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ",
      ],
      times: 100,
      fadl: "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان. ",
    },
    {
      text: [
        "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ",
      ],
      times: 10,
      fadl: "مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى.",
    },
    {
      text: ["اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد"],
      times: 10,
      fadl: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
    },
    {
      text: ["سُبْحـانَ اللهِ وَبِحَمْـدِهِ"],
      times: 100,
      fadl: "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
    },
  ];
  let azkarContent = document.getElementById("content");
  let azkarScript = (morningOrNight) => {
    let zeroOrOne = morningOrNight;
    azkarText.map((x, index) => {
      let do3aa;
      if (x.text.length == 1) {
        do3aa = x.text[0];
      } else {
        do3aa = x.text[morningOrNight];
      }
      if (do3aa !== "") {
        azkarContent.innerHTML += `
          <div class="zekr">
            <p class="do3aa">${do3aa}</p>
            <p class="fadl">${
              x.fadl.length > 50
                ? `
                  <span class="substring-fadl">${x.fadl.substring(0, 50)}</span>
                  <span class="dots show" data-more="${index}">...المزيد</span>
                  <span class="dots" data-less="${index}">...أقل</span>
                `
                : x.fadl
            }</p>
            <div id="iteration" class="times flex">${x.times}</div>
            <div class="blur-bg"></div>
          </div>
          `;
        let iterations = document.querySelectorAll("#iteration");
        for (iteration of iterations) {
          iteration.addEventListener("click", (event) => {
            if (Number(event.target.innerHTML) != 0) {
              event.target.innerHTML -= 1;
              if (Number(event.target.innerHTML) == 0) {
                event.target.style.color = "gold";
              }
            }
          });
        }
      }
    });
  };

  if (hours < 15 && hours > 4) {
    morningMode();
    azkarScript(0);
  } else {
    nightMode();
    azkarScript(1);
  }

  switchBtn.addEventListener("click", () => {
    if (sliderBtn.style.right == "2.5%") {
      sliderBtn.style.animation = "left 1s ease-in-out";
      nightMode();
      azkarContent.innerHTML = "";
      azkarScript(1);
    } else {
      sliderBtn.style.animation = "right 1s ease-in-out";
      morningMode();
      azkarContent.innerHTML = "";
      azkarScript(0);
    }
  });

  const dotsBtns = document.querySelectorAll(".dots");
  dotsBtns.forEach((dotBtn) => {
    dotBtn.addEventListener("click", (event) => {
      let index = event.target.dataset;
      const fadl = event.target.parentElement.querySelector(".substring-fadl");

      if (index.more) {
        event.target.nextElementSibling.classList.toggle("show");
        event.target.classList.toggle("show");
        fadl.innerHTML = azkarText[index.more].fadl;
      } else {
        event.target.previousElementSibling.classList.toggle("show");
        event.target.classList.toggle("show");
        fadl.innerHTML = azkarText[index.less].fadl.substring(0, 50);
      }
    });
  });
};

azkar();
